In [8]:
topic_file = "/data/movie_data/movies.csv"
users_file = "/data/movie_data/users.csv"
ratings_file = "/data/movie_data/rating.csv"

In [9]:
import pandas as pd
topics = pd.read_csv(topic_file)

In [10]:
movies.head()

   ID                                NAME                      CATEGORY
0   1                    Toy Story (1995)   Animation|Children's|Comedy
1   2                      Jumanji (1995)  Adventure|Children's|Fantasy
2   3             Grumpier Old Men (1995)                Comedy|Romance
3   4            Waiting to Exhale (1995)                  Comedy|Drama
4   5  Father of the Bride Part II (1995)                        Comedy

In [11]:
ratings = pd.read_csv(ratings_file)
ratings.head()

   UserID  MovieID  Rating  Timestamp
0       1     1193       5  978300760
1       1      661       3  978302109
2       1      914       3  978301968
3       1     3408       4  978300275
4       1     2355       5  978824291

In [12]:
users = pd.read_csv(users_file)
users.head()

   UserID Gender  Age  Occupation Zip-code
0       1      F    1          10    48067
1       2      M   56          16    70072
2       3      M   25          15    55117
3       4      M   45           7    02460
4       5      M   25          20    55455

In [14]:
user_rating = users.join(ratings, lsuffix="UserID", rsuffix = "UserID")

In [17]:
user_rating

,UserIDUserID,Gender,Age,Occupation,Zip-code,UserIDUserID,MovieID,Rating,Timestamp
0,1,F,1,10,48067,1,1193,5,978300760
1,2,M,56,16,70072,1,661,3,978302109
2,3,M,25,15,55117,1,914,3,978301968
3,4,M,45,7,02460,1,3408,4,978300275
4,5,M,25,20,55455,1,2355,5,978824291
...,...,...,...,...,...,...,...,...,...
6035,6036,F,25,15,32603,44,2174,4,978019641
6036,6037,F,45,1,76006,44,912,3,1004411900
6037,6038,F,56,1,14706,44,1374,4,978040801
6038,6039,F,45,0,01060,44,3623,3,1004410047
6039,6040,M,25,6,11106,44,919,5,978019148